bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA6450P.xml
                <register caption="Timer/Counter1 Interrupt Flag register" name="TIFR1" offset="0x36" size="1"
                          ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x60" size="1">
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                    <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP"
                              values="WDOG_TIMER_PRESCALE_3BITS"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
                <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="External Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0xF0" name="PCIE"/>
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0xF0" name="PCIF"/>
                    <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
                </register>
                <register caption="Pin Change Mask Register 3" name="PCMSK3" offset="0x73" size="1" mask="0x7F"/>
                <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1" mask="0xFF"/>
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1" mask="0xFF"/>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_100">
            <pin pad="NC" position="1"/>
            <pin pad="PE0" position="2"/>
            <pin pad="PE1" position="3"/>
            <pin pad="PE2" position="4"/>
            <pin pad="PE3" position="5"/>
            <pin pad="PE4" position="6"/>
            <pin pad="PE5" position="7"/>
            <pin pad="PE6" position="8"/>
            <pin pad="PE7" position="9"/>
            <pin pad="VCC" position="10"/>
            <pin pad="GND" position="11"/>
            <pin pad="NC" position="12"/>
            <pin pad="PJ0" position="13"/>
            <pin pad="PJ1" position="14"/>
            <pin pad="NC" position="15"/>
            <pin pad="NC" position="16"/>
            <pin pad="NC" position="17"/>
            <pin pad="NC" position="18"/>
            <pin pad="PB0" position="19"/>
            <pin pad="PB1" position="20"/>
            <pin pad="PB2" position="21"/>
            <pin pad="PB3" position="22"/>
            <pin pad="PB4" position="23"/>
            <pin pad="PB5" position="24"/>
            <pin pad="PB6" position="25"/>
            <pin pad="PB7" position="26"/>
            <pin pad="NC" position="27"/>
            <pin pad="PG3" position="28"/>
            <pin pad="PG4" position="29"/>
            <pin pad="PG5" position="30"/>
            <pin pad="VCC" position="31"/>
            <pin pad="GND" position="32"/>
            <pin pad="XTAL2" position="33"/>
            <pin pad="XTAL1" position="34"/>
            <pin pad="NC" position="35"/>
            <pin pad="NC" position="36"/>
            <pin pad="PJ2" position="37"/>
            <pin pad="PJ3" position="38"/>
            <pin pad="PJ4" position="39"/>
            <pin pad="PJ5" position="40"/>
            <pin pad="PJ6" position="41"/>
            <pin pad="NC" position="42"/>
            <pin pad="PD0" position="43"/>
            <pin pad="PD1" position="44"/>
            <pin pad="PD2" position="45"/>
            <pin pad="PD3" position="46"/>
            <pin pad="PD4" position="47"/>
            <pin pad="PD5" position="48"/>
            <pin pad="PD6" position="49"/>
            <pin pad="PD7" position="50"/>
            <pin pad="PG0" position="51"/>
            <pin pad="PG1" position="52"/>
            <pin pad="PC0" position="53"/>
            <pin pad="PC1" position="54"/>
            <pin pad="PC2" position="55"/>
            <pin pad="PC3" position="56"/>
            <pin pad="PC4" position="57"/>
            <pin pad="PC5" position="58"/>
            <pin pad="NC" position="59"/>
            <pin pad="NC" position="60"/>
            <pin pad="NC" position="61"/>
            <pin pad="NC" position="62"/>
            <pin pad="PH0" position="63"/>
            <pin pad="PH1" position="64"/>
            <pin pad="PH2" position="65"/>
            <pin pad="PH3" position="66"/>
            <pin pad="NC" position="67"/>
            <pin pad="PC6" position="68"/>
            <pin pad="PC7" position="69"/>
            <pin pad="PG2" position="70"/>
            <pin pad="PA7" position="71"/>
            <pin pad="PA6" position="72"/>
            <pin pad="PA5" position="73"/>
            <pin pad="PA4" position="74"/>
            <pin pad="PA3" position="75"/>
            <pin pad="PA2" position="76"/>
            <pin pad="PA1" position="77"/>
            <pin pad="PA0" position="78"/>
            <pin pad="NC" position="79"/>
            <pin pad="VCC" position="80"/>
            <pin pad="GND" position="81"/>
            <pin pad="NC" position="82"/>
            <pin pad="NC" position="83"/>
            <pin pad="PH4" position="84"/>
            <pin pad="PH5" position="85"/>
            <pin pad="PH6" position="86"/>
            <pin pad="PH7" position="87"/>
            <pin pad="NC" position="88"/>
            <pin pad="NC" position="89"/>
            <pin pad="PF7" position="90"/>
            <pin pad="PF6" position="91"/>
            <pin pad="PF5" position="92"/>
            <pin pad="PF4" position="93"/>
            <pin pad="PF3" position="94"/>
            <pin pad="PF2" position="95"/>
            <pin pad="PF1" position="96"/>
            <pin pad="PF0" position="97"/>
            <pin pad="AREF" position="98"/>
            <pin pad="AGND" position="99"/>
            <pin pad="AVCC" position="100"/>
        </pinout>
    </pinouts>
</target-description-file>
